readme.org
#+title: Luca's emacs configuration
#+SLUG: emacsd
#+DATE: <2023-03-23>
#+AUTHOR: Luca Cambiaghi
#+PROPERTY: header-args:emacs-lisp :tangle ./config.el :mkdirp yes
#+STARTUP: show2levels
#+OPTIONS: toc:nil num:nil ^:nil

* About this config
** History

After using [[https://github.com/doomemacs/doomemacs][doom-emacs]] for the whole of 2020, in early 2021 I wrote
[[https://github.com/lccambiaghi/vanilla-emacs][my own config from scratch]]. Over 2 years I accumulated snippets and
packages until it became slow and complex. In 2023 I decided to
simplify my configuration files.

Approach:
- Use [[https://github.com/SystemCrafters/crafted-emacs][crafted-emacs]] as a solid foundation
  - Great =init.el= and =early-init.el=
  - Solid defaults for built-in packages e.g. =org-mode=
  - Great configuration of essential external packages e.g. =corfu=, =vertico=, ...
- Cherry-pick the essential parts of my "big" vanilla config
- Use more of the built-in packages, ~emacs29~ comes with a lot of cool
  stuff (=use-package=, =tree-sitter=, =modus-themes=), plus I can try
  leverage more of the features introduced with emacs 27 and 28
  (=project=, =tab-bar=, =flymake=). I tried to set up =eglot= but
  I really need =dap-mode=.

** Structure

Sections:
- [[id:134D0B3D-6BA7-4240-A586-49AF1C343F35][Emacs core settings]]
  - Configuration with =(use-package emacs)= blocks (no external packages), variables, helpers
  - Install =no-littering=
  - Load modules provided by =crafted-emacs=
  - Install =vc-use-package= to add the =:vc= keyword to =use-package=
- [[id:9BC5F95A-DE45-4F06-BB2B-A3EA810FA11F][User interface]]
  - First =(use-package emacs)= blocks
  - Then external packages
- Packages
  - [[id:EE1017C0-A622-4637-8E13-D8DF41474471][Evil]]
  - [[id:C36F8C53-5CA7-4092-8DBF-9E2654A2BC5F][GPT interface]]
  - [[id:0F716E8A-CA57-4664-A33A-C991FB503993][Git]]
  - [[id:881FB236-BBA7-4447-B670-CBA6778C119A][Org mode]]
  - [[id:02101696-D85E-4A96-8EEE-8D19FE710F1B][Other misc packages]]
  - [[id:F10EA50B-0AB5-45EE-B2D2-1780CA5C0E00][Programming languages]]
- [[id:07C0EE37-AD32-47E3-B859-8F6BDF48A45E][Global keybindings]]

In my previous "big" config I had organized everything into modules
but I found that I need all the packages I use and I don't need the
packages I don't use. This means I always need all modules, which
means I don't need any modules.

The only exception could the [[id:F10EA50B-0AB5-45EE-B2D2-1780CA5C0E00][Programming languages]] section,
where maybe I will only rarely need to use the =R= packages or the
=clojure= packages. If you think about it, since all packages are
deferred, they will only be loaded when needed. This means that the
only cost of keeping those sections in my config is the time spent
installing the packages on the first setup.
** Notable sections

Here I report sections that greatly improve my productivity or that I
am particularly proud of. 

In order of appearance in my config:
- [[id:52D73878-07D4-4CFF-9C2C-A33FC681EDC3][Enlarge window]] (copied from DOOM)
- [[id:405DD8F8-3413-4574-85C3-BF25E4D06464][Web browser in emacs]] (requires =emacs= built with widgets support)
- [[id:FF09079B-3767-40B3-9594-FDC8B522D8F5][Search code on github]]
- [[id:BFFC1A23-0EB5-4447-83EB-C5B11E44E7F6][Jump to bookmark]]
- [[id:34178C71-DA01-4ABB-BAE7-721A5241A3E6][Eval operator]] (copied from DOOM)
- evil text objects [[id:89EB24FE-D468-47D1-9830-D35B8DFA74A9][for org mode]] (code block and subtree), [[id:59747AC7-E301-4E28-BB49-DBE271F5346C][for outer form]] and [[id:DB7634CB-ACA6-4231-A353-7944A6934639][for buffer]]
- [[id:986C646E-3A9C-4E12-9714-1C4AD7B108C7][Complete region with chatGPT]]
- [[id:5A2C863C-BAFB-4A12-B7F4-19E9419E4B3F][Use org-id in links]]
- [[id:13700741-D5F0-42DA-9C2F-9F16E1939C5E][csv mode]]
- [[id:696CB40C-C156-4200-8765-2A5195019370][dap mode]] (=dap-inspect-df= function)
- [[id:FD007CD2-4FBE-4B84-9B21-64BC458DAA17][jupyter]]
- [[id:C6B74718-A162-4F16-A39D-40F96AF90589][org-jupyter-mode]] and [[id:DB6857A4-6F8F-4338-BB1A-3A5BC12700E4][scimax-jupyter]]

* Emacs core settings
:PROPERTIES:
:ID:       134D0B3D-6BA7-4240-A586-49AF1C343F35
:END:
** use-package

#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq use-package-always-ensure t)
  (setq use-package-always-defer t)
  (setq use-package-compute-statistics t)
  (setq use-package-expand-minimally t))
#+end_src

** User variables

#+begin_src emacs-lisp
(use-package emacs
  :init
  (defvar lc/config-directory "~/.config/emacs/")
  (defvar lc/use-xwidget-browser nil)
  (defvar lc/light-theme 'modus-operandi)
  (defvar lc/dark-theme 'modus-vivendi)
  ;; fix void-variable in some packages e.g. helpful
  (defvar read-symbol-positions-list nil)
  (defvar lc/use-lambda-line nil)
  (defvar lc/use-lambda-theme nil)
  (defvar lc/copilot-enabled nil)
  (defvar lc/beorg-folder "~/Library/Mobile Documents/iCloud~com~appsonthemove~beorg/Documents/beorg/")
  )
#+end_src

** Helper for tangling

#+begin_src emacs-lisp
(use-package emacs
  :hook
  (org-mode . (lambda ()
                (add-hook 'after-save-hook #'org-babel-tangle-config)))
  :init
  (defun org-babel-tangle-config ()
    (interactive)
    (when (string-equal (buffer-file-name)
                        (expand-file-name "readme.org" lc/config-directory))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle)))))
#+end_src

** Use y-or-n

#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq use-short-answers t))
#+end_src

** COMMENT Disable electric-indent-mode

#+begin_src emacs-lisp
(use-package emacs
  :init
  (electric-indent-mode -1))
#+end_src

** jump to bookmark
:PROPERTIES:
:ID:       BFFC1A23-0EB5-4447-83EB-C5B11E44E7F6
:END:

#+begin_src emacs-lisp
(use-package bookmark
  :ensure nil
  :bind
  ("<leader>rr" . 'bookmark-set)
  ("<leader>rd" . 'bookmark-delete)
  ("<leader>r1" . (lambda () (interactive) (bookmark-set "1")))
  ("<leader>r2" . (lambda () (interactive) (bookmark-set "2")))
  ("<leader>r3" . (lambda () (interactive) (bookmark-set "3")))
  ("<leader>r4" . (lambda () (interactive) (bookmark-set "4")))
  ("s-1" . (lambda () (interactive) (bookmark-jump "1")))
  ("s-2" . (lambda () (interactive) (bookmark-jump "2")))
  ("s-3" . (lambda () (interactive) (bookmark-jump "3")))
  ("s-4" . (lambda () (interactive) (bookmark-jump "4"))))
#+end_src

** Enlarge window
:PROPERTIES:
:ID:       52D73878-07D4-4CFF-9C2C-A33FC681EDC3
:END:

#+begin_src emacs-lisp
(use-package emacs
  :bind
  ("<leader>wo" . 'doom/window-enlargen)
  :init
  (defun doom/window-enlargen (&optional arg)
    "Enlargen the current window to focus on this one. Does not close other
windows (unlike `doom/window-maximize-buffer'). Activate again to undo."
    (interactive "P")
    (let ((param 'doom--enlargen-last-wconf))
      (cl-destructuring-bind (window . wconf)
          (or (frame-parameter nil param)
              (cons nil nil))
        (set-frame-parameter
         nil param
         (if (and (equal window (selected-window))
                  (not arg)
                  wconf)
             (ignore
              (let ((source-window (selected-window)))
                (set-window-configuration wconf)
                (when (window-live-p source-window)
                  (select-window source-window))))
           (prog1 (cons (selected-window) (or wconf (current-window-configuration)))
             (let* ((window (selected-window))
                    (dedicated-p (window-dedicated-p window))
                    (preserved-p (window-parameter window 'window-preserved-size))
                    (ignore-window-parameters t)
                    (window-resize-pixelwise nil)
                    (frame-resize-pixelwise nil))
               (unwind-protect
                   (progn
                     (when dedicated-p
                       (set-window-dedicated-p window nil))
                     (when preserved-p
                       (set-window-parameter window 'window-preserved-size nil))
                     (maximize-window window))
                 (set-window-dedicated-p window dedicated-p)
                 (when preserved-p
                   (set-window-parameter window 'window-preserved-size preserved-p))
                 (add-hook 'doom-switch-window-hook #'doom--enlargened-forget-last-wconf-h)))))))))
  )
#+end_src

** Web browser in emacs
:PROPERTIES:
:ID:       405DD8F8-3413-4574-85C3-BF25E4D06464
:END:

Note:
- Sometimes after browsing the web and returning to a buffer
  (e.g. this config) some bindings get erased (e.g. =ESC= does not
  return to normal mode)
- Apparently this behavior is only buffer local so to fix it one can
  just kill the tabspace, reopen the buffer and they get restored

#+begin_src emacs-lisp
(use-package emacs
  :bind
  ("<leader>sw" . (lambda () (interactive)
                    (tabspaces-switch-or-create-workspace "web")
                    (lc/open-url "google.com")))
  ("<leader>su" . (lambda () (interactive) (call-interactively 'lc/open-url)))
  :init
  (setq lc/xwidget-webkit-last-session-buffer nil)
  (defun lc/open-url-other-window (url &optional new-session)
    (let ((orig-last-session-buffer (if (boundp 'xwidget-webkit-last-session-buffer)
                                        xwidget-webkit-last-session-buffer
                                      nil)))
      (setq xwidget-webkit-last-session-buffer lc/xwidget-webkit-last-session-buffer)
      (save-window-excursion
        (xwidget-webkit-browse-url url new-session))
      (pop-to-buffer xwidget-webkit-last-session-buffer)
      (setq lc/xwidget-webkit-last-session-buffer xwidget-webkit-last-session-buffer)
      (setq xwidget-webkit-last-session-buffer orig-last-session-buffer)))
  (defun lc/open-url (url &optional other-window new-session)
    (interactive
     (list
      (read-string  "Enter URL or keywords: " nil 'eww-prompt-history "")))
    (if other-window
        (lc/open-url-other-window url new-session)
      (xwidget-webkit-browse-url url new-session))))
#+end_src

