readme.org
** Search code on github
:PROPERTIES:
:ID:       FF09079B-3767-40B3-9594-FDC8B522D8F5
:END:

#+begin_src emacs-lisp
(use-package emacs
  :bind
  ("<leader>sc" . 'github-code-search)
  :init
  (defun github-code-search ()
    "Search code on github for a given language."
    (interactive)
    (let* ((language (completing-read
                      "Language: "
                      '("Emacs+Lisp" "Python"  "Clojure" "R")))
           (code
            (thread-last
              (read-string "Code: ") (replace-regexp-in-string " " "+")))
           (url (concat "https://github.com/search?l=" language "&type=code&q=" code)))
      (if lc/use-xwidget-browser
          (lc/open-url-other-window url)
        (browse-url url)))))
#+end_src

** Search on google

#+begin_src emacs-lisp
(use-package emacs
  :bind
  ("<leader>sg" . 'google-search)
  :init
  (defun google-search-str (str)
    (let* ((keywords (replace-regexp-in-string " " "+" str))
          (url (concat "https://www.google.com/search?q=" keywords)))
      (if lc/use-xwidget-browser
          (lc/open-url-other-window url)
        (browse-url url))))
  (defun google-search ()
    "Google search region, if active, or ask for search string."
    (interactive)
    (if (region-active-p)
        (google-search-str
         (buffer-substring-no-properties (region-beginning) (region-end)))
      (google-search-str (read-from-minibuffer "Search: ")))))
#+end_src

** no-littering

#+begin_src emacs-lisp
(use-package no-littering
  :init
  (require 'recentf)
  (require 'no-littering)
  (setq make-backup-files nil)
  (setq auto-save-default nil)
  (setq create-lockfiles nil)
  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory))
#+end_src

** Popup management

#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq display-buffer-alist
        `((,(rx bos (or "*Apropos*" "*Help*" "*helpful" "*info*" "*Summary*") (0+ not-newline))
           (display-buffer-reuse-mode-window display-buffer-below-selected)
           (window-height . 0.33)
           (mode apropos-mode help-mode helpful-mode Info-mode Man-mode))))
  )
#+end_src

** Start server

#+begin_src emacs-lisp
(use-package emacs
  :init
  (unless (and (fboundp 'server-running-p) (server-running-p))
    (server-start)))
#+end_src

** add :vc keyword to use-package

#+begin_src emacs-lisp
(use-package emacs
  :init
  (unless (package-installed-p 'vc-use-package)
    (package-vc-install "https://github.com/slotThe/vc-use-package"))
  (require 'vc-use-package))
#+end_src

** Set fill-column to 82 characters

#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq-default fill-column 82)
  )
#+end_src

** macro: run-hook-once

#+begin_src emacs-lisp
(use-package emacs
  :init

  (defmacro lc/run-hook-once (hook func &rest args)
    "a wrapper to run a func on a hook only once"
    (let ((func-once (gensym (concat "my/" (symbol-name func)
                                     "-" "at-" (symbol-name hook) "-" "once"))))
      `(add-hook ',hook
                 (defun ,func-once ()
                   (funcall #',func)
                   (remove-hook ',hook #',func-once)) ,@args)))
  )
#+end_src

** load packages incrementally

#+begin_src emacs-lisp
(use-package emacs
  :init
  (defvar lc/packages-to-load-incr ()
    "packages to be loaded incrementally after startup")
  (defvar lc/load-incr-timer 2
    "time to load packages incrementally for the first time")
  (defvar lc/load-incr-idle-time 0.75
    "idle time to load packages incrementally")

  (defun lc/load-packages-incrementally (pkgs)
    "load package from PKGS incrementally"
    (let ((gc-cons-threshold most-positive-fixnum)
          (pkg (car pkgs))
          (rest-pkgs (cdr pkgs)))
      (when pkgs
        (if (featurep pkg)
            (lc/load-packages-incrementally rest-pkgs)
          (progn
            (require pkg)
            (run-with-idle-timer
             lc/load-incr-idle-time nil
             #'lc/load-packages-incrementally rest-pkgs))))))

  (defun lc/load-packages-incrementally-setup ()
    "Set up a idle timer to start idly load packages."
    (run-with-idle-timer
     lc/load-incr-timer nil
     #'lc/load-packages-incrementally lc/packages-to-load-incr))

  )
#+end_src

** enable winner mode

#+begin_src emacs-lisp
(use-package emacs
  :init
  (winner-mode 1))
#+end_src

** auto pair parentheses

#+begin_src emacs-lisp
(use-package emacs
  :init
  (electric-pair-mode 1)
  )
#+end_src

** completion buffer

#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq tab-always-indent 'complete)
  ;; hide completions buffer after completion
  (setq completion-auto-help t)
  ;; switch to completions buffer on second tab
  (setq completion-auto-select 'second-tab)
  ;; show one column in completions buffer
  (setq completions-format 'one-column)
  (setq completions-max-height 20)

  ;; Up/down when completing in the minibuffer
  (define-key minibuffer-local-map (kbd "C-k") #'minibuffer-previous-completion)
  (define-key minibuffer-local-map (kbd "C-j") #'minibuffer-next-completion)
  ;; Up/down when competing in a normal buffer
  (define-key completion-in-region-mode-map (kbd "C-k") #'minibuffer-previous-completion)
  (define-key completion-in-region-mode-map (kbd "C-j") #'minibuffer-next-completion)
  (defun lc/sort-by-alpha-length (elems)
    "Sort ELEMS first alphabetically, then by length."
    (sort elems (lambda (c1 c2)
                  (or (string-version-lessp c1 c2)
                      (< (length c1) (length c2))))))

  (defun lc/sort-by-history (elems)
    "Sort ELEMS by minibuffer history.
Use `mct-sort-sort-by-alpha-length' if no history is available."
    (if-let ((hist (and (not (eq minibuffer-history-variable t))
			(symbol-value minibuffer-history-variable))))
	(minibuffer--sort-by-position hist elems)
      (lc/sort-by-alpha-length elems)))

  (defun lc/completion-category ()
    "Return completion category."
    (when-let ((window (active-minibuffer-window)))
      (with-current-buffer (window-buffer window)
	(completion-metadata-get
	 (completion-metadata (buffer-substring-no-properties
                               (minibuffer-prompt-end)
                               (max (minibuffer-prompt-end) (point)))
                              minibuffer-completion-table
                              minibuffer-completion-predicate)
	 'category))))

  (defun lc/sort-multi-category (elems)
    "Sort ELEMS per completion category."
    (pcase (lc/completion-category)
      ('nil elems) ; no sorting
      ('kill-ring elems)
      ('project-file (lc/sort-by-alpha-length elems))
      (_ (lc/sort-by-history elems))))

  (setq completions-sort #'lc/sort-multi-category)

  )
#+end_src

* User interface
:PROPERTIES:
:ID:       9BC5F95A-DE45-4F06-BB2B-A3EA810FA11F
:END:
** Maximize frame on startup

#+begin_src emacs-lisp
(use-package emacs
  :init
  (add-hook 'window-setup-hook 'toggle-frame-maximized t))
#+end_src

