readme.org
** Modus themes

#+begin_src emacs-lisp
(use-package emacs
  :if (not lc/use-lambda-theme)
  :init
  (require-theme 'modus-themes)

  ;; Add all your customizations prior to loading the themes
  (setq modus-themes-italic-constructs t
        modus-themes-org-blocks 'greyscale ; {nil,'greyscale,'rainbow}
        ;; modus-themes-variable-pitch-ui t
        ;; modus-themes-mixed-fonts t
        modus-themes-headings (quote ((1 . (variable-pitch 1.4))
                                      (2 . (variable-pitch 1.25))
                                      (3 . (variable-pitch 1.1))
                                      (t . (monochrome))))
        modus-themes-bold-constructs t)

  ;; define some palette overrides
  (defun lc/override-modus-themes-colors ()
    (setq modus-themes-operandi-color-overrides
          '((bg-main . "#fefcf4")
            (bg-dim . "#faf6ef")
            (bg-alt . "#f7efe5")
            (bg-hl-line . "#f4f0e3")
            (bg-active . "#e8dfd1")
            (bg-inactive . "#f6ece5")
            (bg-region . "#c6bab1")
            (bg-header . "#ede3e0")
            (bg-tab-bar . "#dcd3d3")
            (bg-tab-active . "#fdf6eb")
            (bg-tab-inactive . "#c8bab8")
            (fg-unfocused ."#55556f")))
    (setq modus-themes-vivendi-color-overrides
          '((bg-main . "#100b17")
            (bg-dim . "#161129")
            (bg-alt . "#181732")
            (bg-hl-line . "#191628")
            (bg-active . "#282e46")
            (bg-inactive . "#1a1e39")
            (bg-region . "#393a53")
            (bg-header . "#202037")
            (bg-tab-bar . "#262b41")
            (bg-tab-active . "#120f18")
            (bg-tab-inactive . "#3a3a5a")
            (fg-unfocused . "#9a9aab"))))

  (lc/override-modus-themes-colors)
  (setq lc/light-theme 'modus-operandi)
  (setq lc/dark-theme 'modus-vivendi)
  )
#+end_src

** Font

#+begin_src emacs-lisp
(use-package emacs
  :init
  (defcustom lc/default-font-family "fira code" 
    "Default font family"
    :type 'string
    :group 'lc)

  (defcustom lc/variable-pitch-font-family "Sans Serif" ;; "cantarell" ;; 
    "Variable pitch font family"
    :type 'string
    :group 'lc)
  
  (defcustom lc/laptop-font-size 150
    ;; (if lc/is-windows 100 150)
    "Font size used for laptop"
    :type 'int
    :group 'lc)
  
  (defcustom lc/monitor-font-size
    150
    "Font size used for laptop"
    :type 'int
    :group 'lc)

  (defcustom lc/theme nil
    "Current theme (light or dark)"
    :type 'symbol
    :options '(light dark)
    :group 'lc)
  
  (defun lc/get-font-size ()
    "font size is calculated according to the size of the primary screen"
    (let* (;; (command "xrandr | awk '/primary/{print sqrt( ($(nf-2)/10)^2 + ($nf/10)^2 )/2.54}'")
           (command "osascript -e 'tell application \"finder\" to get bounds of window of desktop' | cut -d',' -f3")
           (screen-width (string-to-number (shell-command-to-string command))))  ;;<
      (if (> screen-width 2560) lc/monitor-font-size lc/laptop-font-size))) 
  (defun lc/set-font-size ()
    (interactive)
    ;; Main typeface
    (set-face-attribute 'default nil :family lc/default-font-family :height (lc/get-font-size))
    ;; Set the fixed pitch face (monospace)
    (set-face-attribute 'fixed-pitch nil :family lc/default-font-family)
    ;; Set the variable pitch face
    (set-face-attribute 'variable-pitch nil :family lc/variable-pitch-font-family)
    ;; modeline
    (set-face-attribute 'mode-line nil :family lc/default-font-family :height (lc/get-font-size))
    (set-face-attribute 'mode-line-inactive nil :family lc/default-font-family :height (lc/get-font-size))
    )
  (add-hook 'after-init-hook #'lc/set-font-size)
  )
#+end_src

** all-the-icons

#+begin_src emacs-lisp
(use-package all-the-icons
  :config
  (add-to-list 'all-the-icons-extension-icon-alist
               '("eld" all-the-icons-fileicon "elisp" :face all-the-icons-purple))
  (add-to-list 'all-the-icons-extension-icon-alist
               '("edn" all-the-icons-fileicon "elisp" :face all-the-icons-purple))
  (add-to-list 'all-the-icons-extension-icon-alist
               '("lock" all-the-icons-fileicon "nix" :face all-the-icons-blue))
  (add-to-list 'all-the-icons-extension-icon-alist
               '("toml" all-the-icons-alltheicon "python" :face all-the-icons-dblue))
)
#+end_src

** COMMENT all-the-icons completion

#+begin_src emacs-lisp
(use-package all-the-icons-completion
  :if (display-graphic-p)
  :after (marginalia all-the-icons)
  :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
  :init
  (all-the-icons-completion-mode))
#+end_src

** COMMENT all-the-icons-dired

#+begin_src emacs-lisp
(use-package all-the-icons-dired
  :if (display-graphic-p)
  :hook
  (dired-mode . (lambda () (interactive)
                  (unless (file-remote-p default-directory)
                    (all-the-icons-dired-mode)))))
#+end_src

** nerd-icons-dired

#+begin_src emacs-lisp
(use-package nerd-icons-dired
  :hook (dired-mode . nerd-icons-dired-mode))
#+end_src

** nerd-icons-completion

#+begin_src emacs-lisp
(use-package nerd-icons-completion
  :hook (marginalia-mode . nerd-icons-completion-marginalia-setup)
  :init
  (nerd-icons-completion-mode))
#+end_src

** COMMENT dashboard

#+begin_src emacs-lisp
(use-package dashboard
  :bind
  ("<leader>TAB H" . 'lc/go-to-dashboard)
  :preface
  (defun linum-mode (_) )
  (defun lc/go-to-dashboard ()
    (interactive)
    (kill-matching-buffers dashboard-buffer-name nil 'no-ask)
    (tabspaces-switch-or-create-workspace "Home")
    (dashboard-insert-startupify-lists)
    (switch-to-buffer dashboard-buffer-name))
  :init
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-items
        '((agenda . 10)
          ;; (bookmarks . 5)
          (projects . 10)
          ;; (recents  . 5)
          ;; (registers . 5)
          ))
  (setq dashboard-set-footer nil)
  (setq dashboard-filter-agenda-entry 'dashboard-no-filter-agenda)
  (setq dashboard-projects-backend 'project-el)
  ;; (setq dashboard-match-agenda-entry nil)
  (dashboard-setup-startup-hook))
#+end_src

** welcome-dashboard

#+begin_src emacs-lisp
(use-package welcome-dashboard
  :vc (:fetcher "github" :repo "konrad1977/welcome-dashboard")
  :init
  (setq welcome-dashboard-use-nerd-icons t ;; Use nerd icons instead of all-the-icons
        welcome-dashboard-path-max-length 75
        welcome-dashboard-use-fahrenheit nil ;; show in celcius or fahrenheit.
        welcome-dashboard-min-left-padding 10
        welcome-dashboard-image-file "~/.config/emacs/true.png"
        welcome-dashboard-image-width 200
        welcome-dashboard-image-height 169)
  ;; (welcome-dashboard-create-welcome-hook)
  (defun lc/welcome-dashboard--refresh-screen ()
    "Show the welcome-dashboard screen."
    (setq welcome-dashboard-recentfiles (seq-take recentf-list 9))
    (with-current-buffer (get-buffer-create welcome-dashboard-buffer)
      (let* ((buffer-read-only)
             (image (create-image welcome-dashboard-image-file 'png nil :width welcome-dashboard-image-width :height welcome-dashboard-image-height))
             (size (image-size image))
             (width (car size))
             (left-margin (max welcome-dashboard-min-left-padding (floor (/ (- (window-width) width) 2))))
             (packages (format "%d" (welcome-dashboard--package-length))))
	(erase-buffer)
	(goto-char (point-min))
	(let ((inhibit-read-only t))
          ;; (insert "\n")
          ;; (welcome-dashboard--insert-centered (propertize welcome-dashboard-title 'face 'welcome-dashboard-title-face))
          ;; (welcome-dashboard--insert-recent-files)
          (setq cursor-type nil)

          ;; (insert "\n")
          ;; (welcome-dashboard--insert-todos)
          ;; (welcome-dashboard--insert-text (make-string 60 ?-))

          (insert "\n\n")
          (insert (make-string left-margin ?\ ))
          (insert-image image)
          (insert "\n\n")
          (welcome-dashboard--insert-centered (propertize (format-time-string "%A, %B %d %R") 'face 'welcome-dashboard-time-face))
	  
          (insert "\n")
          (welcome-dashboard--insert-startup-time)
          (welcome-dashboard--insert-package-info packages)
          (welcome-dashboard--insert-weather-info)

          (switch-to-buffer welcome-dashboard-buffer)
          (read-only-mode +1)
          ;; (welcome-dashboard-mode)
          (goto-char (point-min))
          (forward-line 3)))))
  (add-hook 'emacs-startup-hook (lambda () 
                                  (require 'welcome-dashboard)
                                  (lc/welcome-dashboard--refresh-screen))))
#+end_src

