readme.org
*** COMMENT eshell settings

#+begin_src emacs-lisp
(use-package eshell
  :ensure nil
  :bind
  ("<insert-state><up>" . 'eshell-previous-matching-input-from-input)
  :custom
  (eshell-directory-name (concat no-littering-etc-directory "eshell/"))
  ;; auto truncate after 20k lines
  (eshell-buffer-maximum-lines 20000)
  (eshell-scroll-to-bottom-on-input 'all)
  (eshell-scroll-to-bottom-on-output 'all)
  ;; ls
  (eshell-ls-use-colorls t)
  (eshell-ls-use-in-dired nil)
  (eshell-aliases-file (concat no-littering-etc-directory "eshell/alias"))
  :init
  (defvar eshell-prompt-number 0
    "Set a prompt number for eshell.")
  (defvar lem-eshell-aliases
    '(;; Git
      ("gg" "magit-status")

      ;; Listing
      ("ls"  "ls -1X $*")
      ("la" "ls -laX $*")
      ("ll" "ls -lahsX $*")

      ;; Navigation
      ("bb" "consult-buffer")
      ("bd" "eshell-up $1")
      ("d" "dired $1")
      ("e" "find-file $1")
      ("em" "find-file $1")
      ("ed" (eshell/cd "~/.emacs.d"))
      ("ff" "find-file $1")
      ("fo" "find-file-other-window $1")
      ("fr" (consult-recent-file))
      ("pp" "project-switch-project")
      ("pk" "eshell-up-peek $1")
      ("up" "eshell-up $1")

      ;; Search
      ("rg" "rg --color=always $*")

      ;; vterm
      ("vt" "eshell/vterm")

      ;; Quitting
      ("ex" "exit")
      ("x" "exit")
      ("q"  "exit")
      ("qr" "restart-emacs")
      ("qq" "save-buffers-kill-emacs")
      ))
  ;; Define a var to backup aliases that may already exist
  (defvar lem-eshell--default-aliases nil)
  (setq eshell-command-aliases-list lem-eshell-aliases)
  (setq eshell-prompt-function #'lem-eshell-config--prompt-function)
  (advice-add #'eshell-write-aliases-list :override #'ignore)
  (add-hook 'eshell-mode-hook #'lem-setup-eshell)
  (add-hook 'eshell-directory-change-hook #'lem-eshell-list-files-on-cd)
  ;; Implement a "prompt number" section
  (add-hook 'eshell-exit-hook (lambda () (setq eshell-prompt-number 0)))
  (advice-add 'eshell-send-input :before
              (lambda (&rest args) (setq eshell-prompt-number (+ 1 eshell-prompt-number))))

  :config
  ;; See https://github.com/doomemacs/doomemacs/blob/master/modules/term/eshell/
  (setq lem-eshell--default-aliases eshell-command-aliases-list
        eshell-command-aliases-list
        (append eshell-command-aliases-list
                lem-eshell-aliases))
  :preface
  ;; Prompt char
  (defun lem-eshell-config--prompt-char ()
    "Return shell character."
    (format "%s" "λ"))

  (defun lem--pwd-replace-home (pwd)
    "Replace home in PWD with tilde (~) character."
    (interactive)
    (let* ((home (expand-file-name (getenv "HOME")))
           (home-len (length home)))
      (if (and
           (;; <
            >= home-len (length pwd) )
           (equal home (substring pwd 0 home-len)))
          (concat "~" (substring pwd home-len))
        pwd)))

  (defun lem--pwd-shorten-dirs (pwd)
    "Shorten all directory names in PWD except the last two."
    (let ((p-lst (split-string pwd "/")))
      (if (;; <
           > (length p-lst) 2)
          (concat
           (mapconcat (lambda (elm) (if (zerop (length elm)) ""
                                      (substring elm 0 1)))
                      (butlast p-lst 2)
                      "/")
           "/"
           (mapconcat (lambda (elm) elm)
                      (last p-lst 2)
                      "/"))
        ;; Otherwise, we just return the PWD
        pwd)))

  (defun lem--split-directory-prompt (directory)
    (if (string-match-p ".*/.*" directory)
        (list (file-name-directory directory) (file-name-base directory))
      (list "" directory)))

  (defun lem-eshell-config--prompt-function ()
    "Prettify eshell prompt."
    (let* ((os-char (cond ((string-equal system-type "darwin") "")
                          ((string-equal system-type "gnu/linux") "🐧")
                          ((string-equal system-type "cygwin") "🗔")
                          (t "?")))
           (pwd        (eshell/pwd))
           (directory (lem--split-directory-prompt
                       (lem--pwd-shorten-dirs
                        (lem--pwd-replace-home pwd))))
           (parent (car directory))
           (name   (cadr directory)))

      (concat (propertize "\n╭─ " 'face 'lambda-mild)
              (propertize (format "%s" os-char) 'face 'lambda-meek)
              (propertize " ─ "  'face 'lambda-mild)
              (propertize (format-time-string "%H:%M:%S" (current-time))  'face 'lambda-meek)
              (propertize " ─ "  'face 'lambda-mild) (propertize "\xf07c  "  'face 'lambda-meek)
              (propertize parent 'face 'lambda-meek)
              (propertize name 'face `(:inherit lambda-meek :weight bold))
              "\n"
              (propertize (concat "│" (number-to-string eshell-prompt-number))   'face 'lambda-mild)
              "\n"
              (propertize "╰─>>"  'face 'lambda-mild)
              ;; (if branch branch " ")
              (propertize (lem-eshell-config--prompt-char) 'face `(:inherit lambda-yellow :weight ultra-bold))
              ;; needed for the input text to not have prompt face
              (propertize " " 'face 'default))))

  (defun lem-set-eshell-alias (&rest aliases)
    (or (cl-evenp (length aliases))
        (signal 'wrong-number-of-arguments (list 'even (length aliases))))
    (with-eval-after-load 'em-alias
      (while aliases
        (let ((alias (pop aliases))
              (command (pop aliases)))
          (if-let* ((oldval (assoc alias lem-eshell-aliases)))
              (setcdr oldval (list command))
            (push (list alias command) lem-eshell-aliases))))
      (when (boundp 'eshell-command-aliases-list)
        (if lem-eshell--default-aliases
            (setq eshell-command-aliases-list
                  (append lem-eshell--default-aliases lem-eshell-aliases))
          (setq eshell-command-aliases-list lem-eshell-aliases)))))

  (defun lem-eshell-home ()
    "Open eshell in home dir."
    (interactive)
    (let ((default-directory "~/"))
      (require 'eshell)
      (eshell)))

  ;; Open an eshell in current dir, with project as name.
  ;; If called with universal arg, open in home dir.
  (defun lem-call-eshell (&optional arg)
    "Open `eshell' in current dir, with project as name.
If called with universal arg, open in home dir."
    (interactive "P")
    (if arg
        (lem-eshell-home)
      (eshell)))

;;;;; Jump Directories (w/Consult & Consult-Dir)
  (defun eshell/z (&optional regexp)
    "Navigate to a previously visited directory in eshell, or to
any directory proferred by `consult-dir'."
    (let ((eshell-dirs (delete-dups
                        (mapcar 'abbreviate-file-name
                                (ring-elements eshell-last-dir-ring)))))
      (cond
       ((and (not regexp) (featurep 'consult-dir))
        (let* ((consult-dir--source-eshell `(:name "Eshell"
                                                   :narrow ?e
                                                   :category file
                                                   :face consult-file
                                                   :items ,eshell-dirs))
               (consult-dir-sources (cons consult-dir--source-eshell
                                          consult-dir-sources)))
          (eshell/cd (substring-no-properties
                      (consult-dir--pick "Switch directory: ")))))
       (t (eshell/cd (if regexp (eshell-find-previous-directory regexp)
                       (completing-read "cd: " eshell-dirs)))))))


  (defun eshell/vterm ()
    "Open the current directory of the eshell buffer in vterm."
    (interactive)
    (let ((default-directory (eshell/pwd)))
      (vterm)))

(defun eshell-clear-buffer ()
  "Clear terminal"
  (interactive)
  (let ((inhibit-read-only t))
    (erase-buffer)
    (eshell-send-input)))

;;;; Setup Hooks
  (defun lem-setup-eshell ()
    (interactive)
    ;; Clear eshell keybind
    (local-set-key (kbd "C-l") 'eshell-clear-buffer)
    ;; Use imenu to jump prompts
    ;; https://xenodium.com/imenu-on-emacs-eshell/
    (setq-local imenu-generic-expression
                '(("Prompt" " λ \\(.*\\)" 1)))
    ;; Turn off semantic-mode in eshell buffers
    (semantic-mode -1)
    ;; Turn off hl-line-mode
    (hl-line-mode -1)
    ;; Remove fringe
    (set-window-fringes nil 0 0)
    (set-window-margins nil 1 nil)
    ;; Scrolling
    (setq hscroll-margin 0)
    ;; Text wrapping
    (visual-line-mode +1)
    (set-display-table-slot standard-display-table 0 ?\ ))

  ;; ls files on cd
  (defun lem-eshell-list-files-on-cd ()
    "Use ls to show files w/directories first."
    (eshell/ls "-1X"))
  )

;;;; Syntax Highlighting
(use-package eshell-syntax-highlighting
  :after eshell
  :config
  ;; Enable in all Eshell buffers.
  (eshell-syntax-highlighting-global-mode +1))
#+end_src

** eros

#+begin_src emacs-lisp
(use-package eros
  :commands
  (eros-eval-region eros-eval-last-sexp)
  :hook
  (emacs-lisp-mode org-mode lisp-interaction-mode)
  :preface
  (defun eros-eval-region (start end)
    (interactive "r")
    (eros--eval-overlay
     (string-trim
      (with-output-to-string
        (eval-region start end standard-output)))
     (max (point) (mark))))
  )
#+end_src

** jinx

#+begin_src emacs-lisp
(use-package jinx
  :hook (org-mode . jinx-mode)
  :bind ([remap ispell-word] . jinx-correct))
#+end_src

** flymake

#+begin_src emacs-lisp
(use-package flymake
  :ensure nil
  :bind
  ("<leader>!j" . 'flymake-goto-next-error)
  ("<leader>!k" . 'flymake-goto-prev-error)
  :hook
  (python-ts-mode emacs-lisp-mode)
  :custom
  (flymake-fringe-indicator-position 'right-fringe))
#+end_src

** persistent scratch

#+begin_src emacs-lisp
(use-package persistent-scratch
  :bind
  ("<leader>bs" . (lambda ()
                    "Load persistent-scratch if not already loaded"
                    (interactive)
                    (progn
                      (unless (boundp 'persistent-scratch-mode)
                        (require 'persistent-scratch))
                      (pop-to-buffer "*scratch*"))))
  :custom
  (persistent-scratch-autosave-interval 60)
  :config
  (persistent-scratch-setup-default))
#+end_src

** project

#+begin_src emacs-lisp
(use-package project
  :ensure nil
  :bind
  ("<leader>pf" . 'project-find-file)
  ("<leader>pb" . 'project-switch-to-buffer)
  :init
  (setq project-vc-extra-root-markers '("pyproject.toml" ".project"))
  (setq project-vc-ignores '(".idea" ".vscode" ".direnv"))
  )
#+end_src

** Rainbow parentheses

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook
  (emacs-lisp-mode clojure-mode))
#+end_src

** tempel

#+begin_src emacs-lisp
(use-package tempel
  :custom
  (tempel-trigger-prefix "<")
  (tempel-path (concat lc/config-directory "/templates.eld"))
  :hook
  ((prog-mode org-mode) . tempel-setup-capf)
  :preface
  ;; Setup completion at point
  (defun tempel-setup-capf ()
    (setq-local completion-at-point-functions
                (cons #'tempel-complete
                      completion-at-point-functions)))
  ;; :init
  ;; (tempel-key "C-c t f" fun emacs-lisp-mode-map)
  )
#+end_src

** Transpose frame

#+begin_src emacs-lisp
(use-package transpose-frame
  :bind
  ("<leader>wt" . 'transpose-frame)
  ;; flip
  ("<leader>wf" . 'rotate-frame))
#+end_src

** tab-bar

#+begin_src emacs-lisp
(use-package tab-bar
  :ensure nil
  :custom
  (tab-bar-show nil)
  :bind
  ("<leader>TAB h" . 'tab-bar-switch-to-prev-tab)
  ("<leader>TAB l" . 'tab-bar-switch-to-next-tab)
  )
#+end_src

