readme.org
** COMMENT lsp-mode

#+begin_src emacs-lisp
(use-package lsp-mode
  :commands
  (lsp-deferred)
  :hook
  (lsp-mode . (lambda ()
                (setq-local evil-lookup-func #'lsp-describe-thing-at-point)
                (setq-local lsp-enable-indentation nil)))
  ;; :general
  ;; (lc/local-leader-keys
  ;;   :states 'normal
  ;;   :keymaps 'lsp-mode-map
  ;;   "i" '(:ignore t :which-key "import")
  ;;   "i o" '(lsp-organize-imports :wk "optimize")
  ;;   "l" '(:keymap lsp-command-map :wk "lsp")
  ;;   "a" '(lsp-execute-code-action :wk "code action")
  ;;   "r" '(lsp-rename :wk "rename"))
  :custom
  (lsp-restart 'ignore)
  (lsp-eldoc-enable-hover nil)
  (lsp-signature-auto-activate nil)
  ;; (lsp-eldoc-render-all nil)
  (lsp-enable-file-watchers nil)
  (lsp-keep-workspace-alive nil)
  (lsp-auto-execute-action nil)
  (lsp-before-save-edits nil)
  (lsp-headerline-breadcrumb-enable nil)
  (lsp-modeline-diagnostics-enable nil)
  (lsp-diagnostics-provider :none)
  :config
  (add-to-list 'lsp-language-id-configuration '(python-ts-mode . "python"))
  )
#+end_src

** COMMENT lsp-ui

#+begin_src emacs-lisp
(use-package lsp-ui
  :bind
  ("<localleader>g" . 'lsp-ui-doc-glance)
  :custom
  (lsp-ui-doc-show-with-cursor nil) ;; change this to t for auto doc
  (lsp-ui-doc-delay 2)
  (lsp-ui-doc-show-with-mouse nil)
  (lsp-ui-sideline-enable nil)
  ;; (lsp-ui-sideline-show-diagnostics nil)
  ;; (lsp-ui-sideline-show-hover nil)
  )
#+end_src

** Clojure
*** Clojure mode

#+begin_src emacs-lisp
(use-package clojure-mode
  :mode "\\.clj$"
  :init
  (setq clojure-align-forms-automatically t)
	)
#+end_src

*** clojure-lsp

#+begin_src emacs-lisp
(use-package clojure-mode
  :after (lsp-mode)
  :hook
  ((clojure-mode clojurescript-mode)
   . (lambda ()
       (setq-local lsp-enable-indentation nil ; cider indentation
                   lsp-enable-completion-at-point nil ; cider completion
                   )
       (lsp-deferred)))
  )
#+end_src

*** Cider

#+begin_src emacs-lisp
(use-package cider
  :hook ((cider-repl-mode . evil-normalize-keymaps)
         (cider-mode . (lambda ()
                         (setq-local evil-lookup-func #'cider-doc)))
         (cider-mode . eldoc-mode))
  :bind
  (:map clojure-mode-map
        ("<localleader>c" . 'cider-connect-clj)
        ("<localleader>j" . 'cider-jack-in)
        ("<localleader>J" . 'cider-jack-in-cljs)
        ("<localleader>dd" . 'cider-debug-defun-at-point)
        ("<localleader>eb" . 'cider-eval-buffer)
        ("<localleader>el" . 'cider-eval-last-sexp)
        ("<localleader>eL" . 'cider-pprint-eval-last-sexp-to-comment)
        ("<localleader>ed" . 'cider-eval-defun-at-point)
        ("<localleader>D" . 'cider-pprint-eval-defun-to-comment)
        ("<localleader>h" . 'cider-clojuredocs-web)
        ("<visual-state><localleader>e" . 'cider-eval-region)
        ;; ("K" . 'cider-doc)
        )
  :init
  (setq nrepl-hide-special-buffers t)
  (setq nrepl-sync-request-timeout nil)
  (setq cider-repl-display-help-banner nil)
  )
#+end_src

*** COMMENT Eval sexp at point

#+begin_src emacs-lisp
(use-package cider
  :init
  (defun mpereira/cider-eval-sexp-at-point (&optional output-to-current-buffer)
    "Evaluate the expression around point.
If invoked with OUTPUT-TO-CURRENT-BUFFER, output the result to current buffer."
    (interactive "P")
    (save-excursion
      (goto-char (- (cadr (cider-sexp-at-point 'bounds))
                    1))
      (cider-eval-last-sexp output-to-current-buffer)))
  )
#+end_src

*** ob-clojure

#+begin_src emacs-lisp
(use-package org
  :config
  (require 'ob-clojure)
  (setq org-babel-clojure-backend 'cider)
  )
#+end_src

*** aggressive-indent

#+begin_src emacs-lisp
;; keep the file indented
(use-package aggressive-indent
  :hook (emacs-lisp-mode))
#+end_src

** Nix

#+begin_src emacs-lisp
(use-package nix-mode
:mode "\\.nix\\'")
#+end_src

** Python
*** COMMENT python-ts-mode

#+begin_src emacs-lisp
(use-package python-mode
  :ensure nil
  :preface
  (defun lc/init-py-ts-mode ()
    (when (treesit-ready-p 'python)
      (unless (member '(python-mode . python-ts-mode) major-mode-remap-alist)
        (add-to-list 'major-mode-remap-alist '(python-mode . python-ts-mode)))))
  :init
  (lc/init-py-ts-mode)
  (setq python-indent-guess-indent-offset nil))
#+end_src

*** black

#+begin_src emacs-lisp
(use-package python-black
  :bind
  (:map python-ts-mode-map
        ("<localleader>=" . 'python-black-buffer)
        )
  ;; :hook (python-mode . python-black-on-save-mode-enable-dwim)
  )
#+end_src

*** csv-mode
:PROPERTIES:
:ID:       13700741-D5F0-42DA-9C2F-9F16E1939C5E
:END:

#+begin_src emacs-lisp
(use-package csv-mode
  :hook (csv-mode . lc/init-csv-mode)
  :bind
  (:map csv-mode-map
        ("<localleader>a" . 'csv-align-fields)
        ("<localleader>A" . 'lc/csv-align-visible)
        ("<localleader>i" . 'lc/init-csv-mode)
        ("<localleader>u" . 'csv-unalign-fields)
        ("<localleader>s" . 'csv-sort-fields)
        ("<localleader>;" . 'lc/set-csv-semicolon-separator)
        ("<localleader>," . 'lc/reset-csv-separators)
        ("<leader>j" . 'csv-columns-hydra/body)
        )
  :init
  (defun lc/forward-word ()
    (interactive)
    (forward-symbol)
    (forward-symbol)
    (backward-word))
  (defun lc/csv-align-visible (&optional arg)
    "Align visible fields"
    (interactive "P")
    (csv-align-fields nil (window-start) (window-end)))
  (defun lc/set-csv-semicolon-separator ()
    (interactive)
    (customize-set-variable 'csv-separators '(";")))
  (defun lc/reset-csv-separators ()
    (interactive)
    (customize-set-variable 'csv-separators lc/default-csv-separators))
  (defun lc/init-csv-mode ()
    (interactive)
    (lc/set-csv-separators)
    (lc/csv-highlight)
    (call-interactively 'csv-align-fields))
  :config
  (require 'cl)
  (require 'color)
  (defun lc/set-csv-separators ()
    (interactive)
    (let* ((n-commas (count-matches "," (point-at-bol) (point-at-eol)))
           (n-semicolons (count-matches ";" (point-at-bol) (point-at-eol))))
      (if ( ; <
           > n-commas n-semicolons)
          (customize-set-variable 'csv-separators '("," "	"))
        (customize-set-variable 'csv-separators '(";" "	")))))
  (defun lc/csv-highlight ()
    (interactive)
    (font-lock-mode 1)
    (let* ((separator (string-to-char (car csv-separators)))
           (n (count-matches (string separator) (point-at-bol) (point-at-eol)))
           (colors (loop for i from 0 to 1.0 by (/ 2.0 n)
                         collect (apply #'color-rgb-to-hex
                                        (color-hsl-to-rgb i 0.3 0.5)))))
      (cl-loop for i from 2 to n by 2
               for c in colors
               for r = (format "^\\([^%c\n]+%c\\)\\{%d\\}" separator separator i)
               do (font-lock-add-keywords nil `((,r (1 '(face (:foreground ,c)))))))))
  (defhydra csv-columns-hydra (:hint nil)
    "
 [_k_] ⇢⇠ previous column [_j_] ⇠⇢ next column
 [_o_] ⇢⇠ expand window
│ [_q_] quit"
    ("j" lc/forward-word)
    ("k" backward-word)
    ("o" doom/window-enlargen)
    ("q" nil :color blue))
  )
  #+end_src

*** direnv

Example of =.envrc= file if we need to use =x86= python:
#+begin_src sh
pwd_hash=$(echo -n $PWD | shasum | cut -d ' ' -f 1)
direnv_layout_dir=$XDG_CACHE_HOME/direnv/layouts/$pwd_hash
layout python /usr/local/homebrew/bin/python3.9
#+end_src

#+begin_src emacs-lisp
(use-package envrc
  :commands
  (envrc-propagate-environment)
  :hook
  (python-ts-mode org-jupyter-mode))
#+end_src

*** COMMENT lsp-pyright

#+begin_src emacs-lisp
(use-package lsp-pyright
  :hook
  (python-ts-mode . (lambda ()
                        (require 'lsp-pyright)
                        (lc/init-pyright)
                        (lsp-deferred)
                        (lsp-diagnostics-mode -1)
                        ))
  :custom
  (lsp-pyright-typechecking-mode "basic")
  (python-indent-guess-indent-offset nil)
  :preface
  (defun lc/init-pyright ()
    (lsp-register-client
     (make-lsp-client
      :new-connection (lsp-stdio-connection (lambda ()
                                              (cons (lsp-package-path 'pyright)
                                                    lsp-pyright-langserver-command-args)))
      ;; NOTE: only change is here, adding python-ts-mode
      :major-modes '(python-mode python-ts-mode)
      :server-id 'pyright
      :multi-root lsp-pyright-multi-root
      :priority 3
      :initialized-fn (lambda (workspace)
                        (with-lsp-workspace workspace
                          ;; we send empty settings initially, LSP server will ask for the
                          ;; configuration of each workspace folder later separately
                          (lsp--set-configuration
                           (make-hash-table :test 'equal))))
      :download-server-fn (lambda (_client callback error-callback _update?)
                            (lsp-package-ensure 'pyright callback error-callback))
      :notification-handlers (lsp-ht ("pyright/beginProgress" 'lsp-pyright--begin-progress-callback)
                                     ("pyright/reportProgress" 'lsp-pyright--report-progress-callback)
                                     ("pyright/endProgress" 'lsp-pyright--end-progress-callback))))
    ))
                            #+end_src

