config.el

(use-package flymake-ruff
  :hook
  (python-ts-mode . flymake-ruff-load))
